.emacs.d/config.org
* repositórios
#+BEGIN_SRC emacs-lisp
(unless (assoc-default "melpa" package-archives)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
(unless (assoc-default "org" package-archives)
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t))
#+END_SRC

* acentos
#+BEGIN_SRC emacs-lisp
(require 'iso-transl)
#+END_SRC

* init
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(setq use-package-verbose t)
(setq use-package-always-ensure t)
(require 'use-package)
(use-package auto-compile
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)

#+END_SRC
** server mode
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC
* aparência
** tema
#+BEGIN_SRC emacs-lisp
(use-package monokai-theme)
#+END_SRC
** desliga UI padrão
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)
#+END_SRC
** pretty printing
#+BEGIN_SRC emacs-lisp
(global-prettify-symbols-mode 1)
#+END_SRC
** all the icons
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons)
#+END_SRC
** nyan mode
#+BEGIN_SRC emacs-lisp
(use-package nyan-mode)
(nyan-mode 1)
#+END_SRC
* extensões adicionais
** ☛ TODO pdf tools 
montar um esquema dentro do emacs pra tirar pedaços de imagens de pdfs
#+BEGIN_SRC emacs-lisp
(add-hook 'pdf-view-mode-hook (lambda() (linum-mode -1)))
(use-package org-pdfview)


(use-package pdf-tools
  :pin manual ;; manually update
  :config
  ;; initialise
  (pdf-tools-install)
  ;; numero de páginas no cache. default 64
  (setq pdf-cache-image-limit 15)
  ;; tempo que ele demora pra apagar uma imagem do cache
  (setq image-cache-eviction-delay 30)
  ;; open pdfs scaled to fit page
  ;; fit-height, fit-width, fit-page
  (setq-default pdf-view-display-size 'fit-page)
  ;; automatically annotate highlights
  (setq pdf-annot-activate-created-annotations t)
  ;;
  ;; use normal isearch
  ;; (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
  ;; turn off cua so copy works
  (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
  ;; more fine-grained zooming
  (setq pdf-view-resize-factor 1.1)
  ;; keyboard shortcuts
  (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
  (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
  (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete))
#+END_SRC
** try
#+BEGIN_SRC emacs-lisp
(use-package try)
#+END_SRC
** nov mode (epub)
#+BEGIN_SRC emacs-lisp
(use-package nov)
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

(setq nov-text-width 80)
#+END_SRC
** smart parens
#+BEGIN_SRC emacs-lisp
(use-package smartparens)
#+END_SRC
** leet code
#+BEGIN_SRC emacs-lisp
(use-package leetcode)
(setq leetcode-prefer-language "python3")
(setq leetcode-prefer-sql "mysql")
#+END_SRC
** relative linum

#+BEGIN_SRC emacs-lisp
(use-package linum-relative)
(setq linum-relative-current-symbol "")
#+END_SRC
** rainbow delimiters
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters)
#+END_SRC
** ☛ TODO screencast gif / keycast
arrumar o keycast
#+BEGIN_SRC emacs-lisp
(use-package gif-screencast)
(use-package keycast)
;;(setq keycast-insert-after "%e")

;;(setq mode-line-format mode-line-keycast)
#+END_SRC
** undo tree
#+BEGIN_SRC emacs-lisp
(use-package undo-tree)
#+END_SRC
* interface
** frames only
esse daqui só presta se for pra usar os frames separados. Tipo no
Qtile, i3, xmonad e etc.
#+BEGIN_SRC emacs-lisp
(use-package frames-only-mode)
(frames-only-mode 1)
#+END_SRC
** yes or no para y or n
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** which key
#+BEGIN_SRC emacs-lisp
(use-package which-key)
(which-key-mode 1)
#+END_SRC
** ✘ CANCELADO ido 
#+BEGIN_SRC emacs-lisp
;;(setq ido-enable-flex-matching t)
;;(setq ido-everywhere t)
;;(ido-mode 1)
#+END_SRC
** helm
#+BEGIN_SRC emacs-lisp
(use-package helm-bibtex)
(use-package helm-company)
(use-package helm
  :diminish helm-mode
  :init
  (progn
    (require 'helm-config)
    (setq helm-candidate-number-limit 100)
    ;; From https://gist.github.com/antifuchs/9238468
    (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
          helm-input-idle-delay 0.01  ; this actually updates things
                                        ; reeeelatively quickly.
          helm-yas-display-key-on-candidate t
          helm-quick-update t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t)
    (helm-mode))
  :bind (("C-c h" . helm-mini)
         ("C-h a" . helm-apropos)
         ("C-x C-b" . helm-buffers-list)
         ("C-x b" . helm-buffers-list)
         ("M-y" . helm-show-kill-ring)
         ("M-x" . helm-M-x)
         ("C-x c o" . helm-occur)
         ("C-x c s" . helm-swoop)
         ("C-x c y" . helm-yas-complete)
         ("C-x c Y" . helm-yas-create-snippet-on-region)
         ("C-x c b" . my/helm-do-grep-book-notes)
         ("C-x c SPC" . helm-all-mark-rings)))
(ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
#+END_SRC
*** atalhos do teclado
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-s") 'helm-occur)
#+END_SRC
** espeak
fazer ele não abrir essa janela
#+BEGIN_SRC emacs-lisp
;; depende do espeak
(defun espeak (text)
  "Speaks text by espeak"
  (save-window-excursion
    (let* ((amplitude 100)
           (voice 'brazil)
           (command (format "espeak -a %s -v %s \"%s\"" amplitude voice text)))
      (async-shell-command command "*Messages*" "*Messages*"))))
#+END_SRC
** desktop save
#+BEGIN_SRC emacs-lisp
(desktop-save-mode 1)
#+END_SRC
** key binds
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x C-b") 'ibuffer)


(define-key company-active-map (kbd "C-n") 'company-select-next-or-abort)
(define-key company-active-map (kbd "C-p") 'company-select-previous-or-abort)
#+END_SRC
* Org mode

** Módulos adicionais

#+BEGIN_SRC emacs-lisp
(setq org-enable-org-journal-support t)
(add-to-list 'org-modules 'org-tempo t)
;; não sei porque mas os módulos do org-plus-contrib precisam ser usados com require
(require 'org-tempo)
(use-package org-journal)
(use-package org-noter)
(use-package org-pretty-tags)
(use-package org-ref)
(use-package org-pomodoro)
(use-package org-download)
(use-package html-to-markdown)
(use-package ox-jekyll-md)
(use-package ox-epub)
(use-package auto-org-md)
(setq org-plantuml-jar-path "/usr/share/java/plantuml/plantuml.jar")
#+END_SRC

** ☛ TODO org-noter
ver se tem jeito de trocar o padrão
#+begin_src emacs-lisp

#+end_src
** ☛ TODO org-agenda
ajeitar esse refile seria uma boa
#+BEGIN_SRC emacs-lisp
;; org-agenda load na pasta do emacs
;; TODO colocar os arquivos direitinho nesse negócio
(setq org-agenda-files '("~/Desktop/"
						 "~/vest/vestibular.org"
						 "~/ossu/ossu.org"
						 "~/semana.org"
						 "~/lang/lang.org"
						 "~/Documents/livros.org"
						 "~/Documents/"
						 "~/vest/"))

;; org refiling pra mandar as tarefas de um arquivo pra outro
(setq org-refile-targets (quote (("~/semana.org" :maxlevel . 1)
								 ("~/notes_accomplished.org" :maxlevel . 1)
								 ("/vest/vestibular.org" :maxlevel . 1)
								 ("~/ossu/ossu.org" :maxlevel . 1))))

(global-set-key (kbd "C-c a") 'org-agenda)
#+END_SRC
** org aparência
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

;; todo states
(setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✓ PRONTO(p)")
                          (sequence "⚑ ESPERANDO(e)" "|")
                          (sequence "|" "✘ CANCELADO(c)")))

(add-hook 'org-mode-hook (lambda () (auto-fill-mode 1)))

(use-package org-bullets)

(setq org-startup-indented t
      org-bullets-bullet-list '("一" "二" "三" "四" "五" "六" "七" "八" "九" "十");; no bullets, needs org-bullets package
	  ;;      org-ellipsis " ⤵" ;; folding symbol
      org-pretty-entities t
      org-hide-emphasis-markers t
      ;; show actually italicized text instead of /italicized text/
      org-agenda-block-separator ""
      org-fontify-whole-heading-line t
      org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t
      org-special-ctrl-a/e t)
#+END_SRC

** org pomodoro

#+BEGIN_SRC emacs-lisp
(shell-command "mkfifo /tmp/.todo-pipe") 

(defun write-todo-pipe-esperando ()
  "writes down esperando message in the todo pipe"
  (write-region "Esperando <fc=#af3a03,#f9f5d7>\xe0b0</fc>\n" 
				nil 
				"/tmp/.todo-pipe" 
				nil 
				'quiet))

(write-todo-pipe-esperando)

(defun write-todo-pipe ()
  "adds a pipe file with the pomodoro modeline, also reads the current task
       from org-clock."
  (write-region
   (concat "\ue003 "
           (org-pomodoro-format-seconds)
           " "
           org-clock-current-task
           " "
           "<fc=#af3a03,#f9f5d7>\xe0b0</fc>" "\n")
   nil "/tmp/.todo-pipe"
   nil 'quiet))

(defun speak-pomodoro ()
  "function that says the name out loud"
  (espeak org-clock-current-task))

(setq org-pomodoro-started-hook 'speak-pomodoro)

;; hook que adiciona a modeline no tick do pomodoro
(setq org-pomodoro-tick-hook 'write-todo-pipe)
;; hook que tira o que estava anteriormente e coloca o esperando
(setq org-pomodoro-finished-hook 'write-todo-pipe-esperando)
;; hook pra tirar a atividade se eu cancelar o pomodoro
(setq org-pomodoro-killed-hook 'write-todo-pipe-esperando)

#+END_SRC
** org clock 
#+BEGIN_SRC emacs-lisp
;; o comando que cria o pipe está no org pomodoro
(defun write-clock-todo-pipe ()
  "escreve as coisas do org-clock no todo-pipe"
  (write-region (concat
                 (car (split-string org-mode-line-string))
                 " " org-clock-heading " "
                 "<fc=#af3a03,#f9f5d7>\xe0b0</fc>" "\n")
                nil "/tmp/.todo-pipe"
                nil 'quiet))

(setq org-clock-out-hook 'write-todo-pipe-esperando)
(setq org-clock-in-prepare-hook 'write-clock-todo-pipe)
#+END_SRC
** org capture
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      '(("t" "☛ TODO" entry (file+headline "~/semana.org" "Tarefas")
	     "* ☛ TODO %^{Descrição breve} %^g \n \n %? \n Adicionado em: %U")
        ("c" "Checklist" entry (file+headline "~/semana.org" "Tarefas")
         "* ☛ TODO %^{Descrição breve} [/] %^g \n- [ ] %? \n Adicionado em: %U")
        ("p" "Programming TODO" entry (file+headline "~/semana.org" "projetos")
         "* ☛ TODO %^{Descrição breve} %^g \n %? \n link: %a \n Adicionado em: %U")
        ("n" "Programming Notes" entry (file+headline "~/ossu/prognotes.org" "notas")
         "* %^{Descrição} %^g \n %x \n")
        ("w" "Citações" entry (file+headline "~/lang/citações.org" "citações")
         "* %^{Descrição} %^gdrill: \n %x \n")
        ("i" "Info" entry (file+headline "~/Documents/emacs.org" "emacs")
         "* %^{Descrição} \n %? \n link: %a \n %:node")
        ("e" "emacs" entry (file+headline "~/Documents/emacs.org" "emacs")
         "* %^{Descrição}  %^g\n %x \n")
        ("j" "日本語" entry (file+headline "~/lang/lang.org" "文法[ぶんぽう]")
         "* %^{Descrição da gramática}\n %? \n")
        ("l" "links internet clipboard" entry (file+headline "~/Desktop/links.org" "links")
         "* %^{Descrição} \n [%x] \n %")
        ("a" "livros/artigos" entry (file+headline "~/Documents/livros.org" "livros")
         "* %^{Título} %^g :referência: \n :PROPERTIES: \n Criado em: %U \n Link: %a \n :END: \n %i \n Descrição:\n %?"
         :prepend t
         :empty-lines 1
         :created t)))

(global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC
** org babel

#+BEGIN_SRC emacs-lisp
(use-package ob-sml)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((clojure    . t)
   (dot        . t)
   (shell      . t)
   (C          . t)
   ;;(cpp        . t)
   (sml        . t)
   (haskell    . t)
   (scheme     . t)
   (sml        . t)
   (python     . t)
   (ocaml      . t)
   (emacs-lisp . t)
   (plantuml   . t)
   (js         . t)
   (octave     . t)
   (ruby       . t)))

(setq org-confirm-babel-evaluate nil
      org-src-fontify-natively t
      org-src-tab-acts-natively t
	  org-src-preserve-indentation nil
	  org-edit-src-content-indentation 0)
#+END_SRC
** org ref
#+BEGIN_SRC emacs-lisp
(use-package org-ref)
#+END_SRC
** ox-reveal
#+begin_src emacs-lisp
(use-package ox-reveal)
#+end_src
** ☛ TODO org-drill
#+begin_src emacs-lisp
(require 'org-drill)
#+end_src
* prog
** hooks
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook (lambda () (progn (linum-relative-mode 1)
											(smartparens-mode 1)
											(rainbow-delimiters-mode 1))))
#+END_SRC
** flycheck
#+BEGIN_SRC emacs-lisp
(use-package flycheck)
(use-package flycheck-irony)
(use-package flycheck-haskell)
(use-package flycheck-pycheckers)
(use-package flycheck-plantuml)
(use-package flycheck-cask)
#+END_SRC
** magit git
#+BEGIN_SRC emacs-lisp
(use-package magit)
#+END_SRC
** auto completion
#+BEGIN_SRC emacs-lisp
(use-package company
  :config (add-hook 'prog-mode-hook 'company-mode))
;; global company mode
(global-company-mode 1)
(use-package company-math)
(use-package company-quickhelp)

(eval-after-load 'company
  '(define-key company-active-map (kbd "C-c h") #'company-quickhelp-manual-begin))

(setq company-quickhelp-delay 1)

#+END_SRC
** outros parametros
*** tamanho das tabulações
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
#+END_SRC
** smart parens
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-<right>") 'sp-forward-slurp-sexp)
(global-set-key (kbd "C-<left>") 'sp-forward-barf-sexp)
(global-set-key (kbd "C-M-<left>") 'sp-backward-slurp-sexp)
(global-set-key (kbd "C-M-<right>") 'sp-backward-barf-sexp)
#+END_SRC
** yasnippets
#+BEGIN_SRC emacs-lisp
(use-package yasnippet)
(use-package yasnippet-classic-snippets)
(use-package yasnippet-snippets)
#+END_SRC
** projectile
#+BEGIN_SRC emacs-lisp
(use-package projectile)
#+END_SRC
** helm dash
#+BEGIN_SRC emacs-lisp
(use-package helm-dash)
#+END_SRC
** octave
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.m" . octave-mode))
#+END_SRC
** C
#+BEGIN_SRC emacs-lisp
(use-package company-irony)
#+END_SRC
** python
#+BEGIN_SRC emacs-lisp
(use-package company-anaconda)

(use-package ein)
#+END_SRC
** haskell
#+BEGIN_SRC emacs-lisp
(use-package haskell-snippets)
(use-package company-ghci)
#+END_SRC
** lisps
** sml
#+BEGIN_SRC emacs-lisp
(use-package sml-mode)
#+END_SRC
** ESS R stats
#+BEGIN_SRC emacs-lisp
(use-package ess)
(use-package ess-smart-underscore)
#+END_SRC
** howdoyou stackoverflow consult
#+BEGIN_SRC emacs-lisp
(use-package howdoyou)
#+END_SRC

